duvallee/STM32F746Discovery/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "main.h"
#include "stm32f7xx_hal.h"
#include "debug_output.h"
#include "lcd_log.h"
#include "touch_ft5536.h"
#include "software_timer.h"
#include "cmsis_os.h"


// #define USE_CLOCK_INTERNAL

// global variable
TIM_HandleTypeDef htim6;
UART_HandleTypeDef huart6;
LTDC_HandleTypeDef hltdc;
DMA2D_HandleTypeDef hdma2d;
SDRAM_HandleTypeDef hsdram1;
DMA_HandleTypeDef hdma_memtomem_dma2_stream0;
TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim12;

#define MILLI_SECOND                                     1000
volatile uint32_t g_System_Start_Second                  = 0;
volatile uint16_t g_System_Start_Milli_Second            = 0;

#define FRAMEBUFFER_SIZE                                 (RK043FN48H_WIDTH * RK043FN48H_HEIGHT)

volatile uint32_t *g_DMA2D_FrameBuffer                   = (uint32_t *) 0xC0700000;
volatile uint32_t *g_FrameBuffer                         = (uint32_t *) 0xC0780000;


#if ( configAPPLICATION_ALLOCATED_HEAP == 1 )
#if 0
uint8_t* ucHeap                                          = (uint8_t *) 0xC0000000;
#else
uint8_t ucHeap[configTOTAL_HEAP_SIZE]                    = {0, };
#endif
#endif

// 522,240, 0x7F800, x2 = 0xFF000, 1044,480
// volatile uint16_t g_FrameBuffer[FRAMEBUFFER_SIZE];


/* --------------------------------------------------------------------------
 * Name : _putc()
 *
 *
 * -------------------------------------------------------------------------- */
static uint8_t g_start_log                               = 0;
int _putc(unsigned char ch)
{
   if (g_start_log == 0)
   {
      return -1;
   }
   draw_char(ch);
   if (HAL_UART_Transmit(&huart6, (uint8_t *) &ch, sizeof(ch), 0xFFFF) == HAL_OK)
   {
      return 0;
   }
   return -1;
}

/* --------------------------------------------------------------------------
 * Name : HAL_GPIO_EXTI_Callback()
 *
 *
 * -------------------------------------------------------------------------- */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
   if (GPIO_Pin == GPIO_PIN_13)
   {
      HAL_GPIO_TogglePin(GPIOI, GPIO_PIN_1);
   }
}

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_LTDC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_DMA_Init(void);
static void MX_FMC_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM12_Init(void);


#if 1

/* --------------------------------------------------------------------------
 * Name : test_servo_1_task()
 *
 *
 * -------------------------------------------------------------------------- */
void test_servo_1_task(void* argument)
{
   TIM_HandleTypeDef* pTimer1                            = (TIM_HandleTypeDef*) argument;
   uint8_t step                                          = 0;

   debug_output_info("start !!! \r\n");
   while (1)
   {
#if 0
//      HAL_GPIO_WritePin(GPIOG, GPIO_PIN_6, GPIO_PIN_SET);
      HAL_GPIO_TogglePin(GPIOG, GPIO_PIN_6);
      osDelay(100);
#else
      debug_output_info("idle \r\n");
      if (step == 0)
      {
         pTimer1->Instance->ARR                          = 20000;
         pTimer1->Instance->CCR1                         = 5000;
         step                                            = 180;
         debug_output_info("180 \r\n");
      }
      else
      {
         pTimer1->Instance->ARR                          = 20000;
         pTimer1->Instance->CCR1                         = 700;
         step                                            = 0;
         debug_output_info("0 \r\n");
      }
      osDelay(10000);
#endif
   }
   vTaskDelete(NULL);
}

/* --------------------------------------------------------------------------
 * Name : test_servo_2_task()
 *
 *
 * -------------------------------------------------------------------------- */
void test_servo_2_task(void* argument)
{
   TIM_HandleTypeDef* pTimer1                            = (TIM_HandleTypeDef*) argument;
   uint8_t step                                          = 0;

