duvallee/STM32F746Discovery/Src/main.c
   debug_output_info("start !!! \r\n");
   while (1)
   {
      debug_output_info("idle \r\n");
#if 1
      if (step == 0)
      {
         pTimer1->Instance->ARR                             = 20000;
         pTimer1->Instance->CCR1                            = 5000;
         step                                               = 180;
         debug_output_info("180 \r\n");
      }
      else
      {
         pTimer1->Instance->ARR                             = 20000;
         pTimer1->Instance->CCR1                            = 700;
         step                                               = 0;
         debug_output_info("0 \r\n");
      }
#endif
      osDelay(10000);
   }
   vTaskDelete(NULL);
}


#else
/* --------------------------------------------------------------------------
 * Name : test_servo_timer1()
 *
 *
 * -------------------------------------------------------------------------- */
void test_servo_timer1(void* pData)
{
   TIM_HandleTypeDef* pTimer1                            = (TIM_HandleTypeDef*) pData;
static uint8_t step                                      = 0;

   if (step == 0)
   {
      pTimer1->Instance->ARR                             = 20000;
      pTimer1->Instance->CCR1                            = 5000;
      step                                               = 180;
      debug_output_info("180 \r\n");
   }
   else
   {
      pTimer1->Instance->ARR                             = 20000;
      pTimer1->Instance->CCR1                            = 700;
      step                                               = 0;
      debug_output_info("0 \r\n");
   }
}

/* --------------------------------------------------------------------------
 * Name : test_servo_timer12()
 *
 *
 * -------------------------------------------------------------------------- */
void test_servo_timer12(void* pData)
{
   TIM_HandleTypeDef* pTimer1                            = (TIM_HandleTypeDef*) pData;
static uint8_t step                                      = 0;

   if (step == 0)
   {
      pTimer1->Instance->ARR                             = 20000;
      pTimer1->Instance->CCR1                            = 5000;
      step                                               = 180;
      debug_output_info("180 \r\n");
   }
   else
   {
      pTimer1->Instance->ARR                             = 20000;
      pTimer1->Instance->CCR1                            = 700;
      step                                               = 0;
      debug_output_info("0 \r\n");
   }
}
#endif

/* --------------------------------------------------------------------------
 * Name : CPU_CACHE_Enable()
 *        CPU L1-Cache enable.
 *
 * -------------------------------------------------------------------------- */
static void CPU_CACHE_Enable(void)
{
   /* Enable branch prediction */
   SCB->CCR                                              |= (1 << 18); 
   __DSB();

   /* Enable I-Cache */
   SCB_EnableICache();	

   /* Enable D-Cache */
   SCB_EnableDCache();
}

/* --------------------------------------------------------------------------
 * Name : main()
 *
 *
 * -------------------------------------------------------------------------- */
int main(void)
{
   CPU_CACHE_Enable();

   HAL_Init();
   SystemClock_Config();

   MX_GPIO_Init();
   MX_DMA_Init();
   MX_FMC_Init();
   MX_USART6_UART_Init();
   MX_TIM6_Init();
   MX_LTDC_Init();
   MX_DMA2D_Init();
   MX_TIM1_Init();
   MX_TIM12_Init();

   // init lcd log
   lcd_log_Init(g_FrameBuffer, RK043FN48H_WIDTH, RK043FN48H_HEIGHT, LTDC_PIXEL_FORMAT_ARGB8888);
   g_start_log                                           = 1;

   // --------------------------------------------------------------------------
   // init software timer
   init_software_timer();

   // --------------------------------------------------------------------------
   debug_output_info("===================================================== \r\n");
   debug_output_info("BUILD   : %s %s \r\n", __DATE__, __TIME__);
   debug_output_info("VERSION : ver0.1.4 \r\n");
   debug_output_info("===================================================== \r\n");

   // init touch driver
   touch_init();

   // --------------------------------------------------------------------------
   HAL_GPIO_WritePin(GPIOI, GPIO_PIN_12, GPIO_PIN_SET);     // Display on
   HAL_GPIO_WritePin(GPIOK, GPIO_PIN_3, GPIO_PIN_SET);      // Backlight on

   // --------------------------------------------------------------------------
   HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
   HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);

#if 1
   xTaskCreate(test_servo_1_task, "servo motor task 1", 1000, (void *) &htim1, 1, NULL);
   xTaskCreate(test_servo_2_task, "servo motor task 2", 1000, (void *) &htim12, 1, NULL);

   /* Start scheduler */
   osKernelStart();

#else
   // --------------------------------------------------------------------------
   // add timer for touch
   add_software_timer(touch_polling, 50, -1, 0);

   // add timer for servo
   add_software_timer(test_servo_timer1, 1000, -1, (void*) &htim1);
   add_software_timer(test_servo_timer12, 1000, -1, (void*) &htim12);

   while (1)
   {
      proc_software_timer();
   }
#endif
}


/* --------------------------------------------------------------------------
 * Name : HAL_SYSTICK_Callback()
 *
 *
 * -------------------------------------------------------------------------- */
void HAL_SYSTICK_Callback(void)
{
   g_System_Start_Milli_Second++;

   if (g_System_Start_Milli_Second >= MILLI_SECOND)
   {
      g_System_Start_Second++;
      g_System_Start_Milli_Second                        = 0;
   }

   if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0) == 0)
   {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, 1);
   }
   else
   {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, 0);
   }
}

#if defined(USE_CLOCK_INTERNAL)
/* --------------------------------------------------------------------------
 * Name : SystemClock_Config()
 *        System Clock Configuration
 *
 * -------------------------------------------------------------------------- */
void SystemClock_Config(void)
{
   RCC_OscInitTypeDef RCC_OscInitStruct;
   RCC_ClkInitTypeDef RCC_ClkInitStruct;
   RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

   /**Configure the main internal regulator output voltage 
   */
   __HAL_RCC_PWR_CLK_ENABLE();
   __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

