duvallee/STM32F746Discovery/Src/main.c
   if (HAL_TIM_PWM_Init(&htim12) != HAL_OK)
   {
    _Error_Handler(__FILE__, __LINE__);
   }

   sConfigOC.OCMode                                      = TIM_OCMODE_PWM1;
   sConfigOC.Pulse                                       = 700;
   sConfigOC.OCPolarity                                  = TIM_OCPOLARITY_HIGH;
   sConfigOC.OCFastMode                                  = TIM_OCFAST_DISABLE;
   if (HAL_TIM_PWM_ConfigChannel(&htim12, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
   {
       _Error_Handler(__FILE__, __LINE__);
   }

   /**TIM12 GPIO Configuration    
   PH6     ------> TIM12_CH1 
   */
   GPIO_InitStruct.Pin                                   = GPIO_PIN_6;
   GPIO_InitStruct.Mode                                  = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull                                  = GPIO_NOPULL;
   GPIO_InitStruct.Speed                                 = GPIO_SPEED_FREQ_LOW;
   GPIO_InitStruct.Alternate                             = GPIO_AF9_TIM12;
   HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);
}


/* --------------------------------------------------------------------------
 * Name : _Error_Handler()
 *
 *
 * -------------------------------------------------------------------------- */
/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char* file, int line)
{
   debug_output_error("******************************************************** \r\n");
   debug_output_error("%s - %d \r\n", file, line);
   debug_output_error("******************************************************** \r\n");
   while(1) 
   {
   }
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
   /* USER CODE BEGIN 6 */
   /* User can add his own implementation to report the file name and line number,
   ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
   /* USER CODE END 6 */

}

#endif

